# 1 ==============================

# a = float(input())
# b = float(input())

# print (0.5 * a * b)

# 2 ==============================

# s1 = float(input())
# v1 = float(input())
# v2 = float(input())

# print (s1 / (v1 + v2))

# 3 ==============================

# num = float(input())

# if (num == 0) :
#     print ("Обратного числа не существует")
# else:
#     print (num ** -1)
    
# 4 ==============================

# F = float(input())

# print ((5/9) * (F - 32))

# 5 ==============================

