# print ("*****************")
# print ("*               *")
# print ("*               *")
# print ("*****************")

# ======================================

# a = int(input())
# b = int(input())

# print ("Квадрат суммы", a, "и", b, "равен", (a + b) * (a + b))
# print ("Сумма квадратов", a, "и", b, "равна", (a * a) + (b * b))

# ======================================

# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())

# print (a**b + c**d)

# ======================================

n = int(input())
n2 = n * 10
n3 = n * 100

print (n + (n + n2) + (n + n2 + n3))